In [2]:
import pandas as pd

In [ ]:
series = pd.Series(["BMW", "Toyota", "Honda"])

In [ ]:
series

In [ ]:
# Series is 1 - dimensional

In [ ]:
colors = pd.Series(["Green", "Blue", "Yellow"])
colors

In [ ]:
# Dataframes are 2 - dimensional

In [ ]:
car_data = pd.DataFrame({
    "Car name": series,
    "Color": colors,
})

car_data

In [ ]:
# Import data

In [8]:
car_sales = pd.read_csv("7.1 car-sales.csv")
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [ ]:
# Export csv
# car_sales.to_csv("exported-car-sales.csv", index=False)

# Describe data

In [ ]:
car_sales.dtypes

In [ ]:
car_columns = car_sales.columns

In [ ]:
car_columns

In [ ]:
car_sales.index

In [ ]:
car_sales.describe()

In [ ]:
car_sales.info()

In [ ]:
car_prices = pd.Series([3000, 2000, 2000])
car_prices.mean()

In [ ]:
car_sales.sum()

In [ ]:
car_sales["Doors"].sum()

In [ ]:
len(car_sales)

# Viewing and selecting

In [ ]:
car_sales.head()

In [ ]:
car_sales.head(3)

In [ ]:
# loc and iloc

In [3]:
animals = pd.Series(["cat", "dog", "snake", "panda", "bat"], index=[0, 3, 6, 8, 5])

In [4]:
animals

0      cat
3      dog
6    snake
8    panda
5      bat
dtype: object

In [5]:
animals.loc[3]

'dog'

In [6]:
animals.loc[8]

'panda'

In [9]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [10]:
car_sales.loc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [11]:
animals

0      cat
3      dog
6    snake
8    panda
5      bat
dtype: object

In [12]:
animals.iloc[3]

'panda'

In [13]:
# loc is location. iloc is position

In [14]:
car_sales.iloc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [15]:
animals.iloc[:2]

0    cat
3    dog
dtype: object

In [16]:
car_sales.loc[:3]

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00

In [ ]:
car_sales["Colour"]

In [ ]:
car_sales.Make

In [ ]:
car_sales[car_sales["Make"] == "Honda"]

In [ ]:
car_sales[(car_sales["Odometer (KM)"] > 50000) & (car_sales["Make"] == "Honda")]

In [ ]:
pd.crosstab(car_sales["Make"], car_sales["Doors"])

In [ ]:
car_sales["Doors"].plot()

In [ ]:
car_sales["Odometer (KM)"].hist()

In [ ]:
car_sales = pd.read_csv("7.1 car-sales.csv")
car_sales.Price

In [ ]:
# car_sales.info()
# car_sales["Price"] = car_sales["Price"].str.replace("\$", "", regex=True).str.replace("\.", "", regex=True).str.replace("\,", "", regex=True).astype(int)
car_sales["Price"] = car_sales["Price"].replace("[\$\,\.]", "", regex=True).astype(int)
car_sales["Price"] = (car_sales["Price"] / 100).astype(int)

In [ ]:
car_sales["Price"]

# Manipulating data

In [ ]:
car_sales["Make"] = car_sales["Make"].str.lower()

In [ ]:
car_sales

In [ ]:
missing_data = pd.read_csv("9.2 car-sales-missing-data.csv")
missing_data

In [ ]:
missing_data["Odometer"].fillna(missing_data["Odometer"].mean())

In [ ]:
missing_data

In [ ]:
missing_data["Odometer"].fillna(missing_data["Odometer"].mean(), inplace=True)

In [ ]:
missing_data

In [ ]:
missing_data.dropna(inplace=True)

In [ ]:
missing_data

In [ ]:
missing_data_dropped = missing_data.dropna()

In [ ]:
missing_data_dropped

In [ ]:
missing_data_dropped.to_csv("missing-data-dropped.csv")

# Column from series

In [ ]:
import pandas as pd
car_sales = pd.read_csv("7.1 car-sales.csv")
car_sales

# Create a new column
# car_seats = pd.Series(5).astype(int)

In [ ]:
# New column called seats
car_sales["Seats"] = car_seats

# Fill nan
car_sales["Seats"].fillna(5, inplace=True)

In [ ]:
car_sales

In [ ]:
# Create column from Python list
fuel_economy = [4.5, 8.3, 8.6, 4.0, 6.5, 3.0, 8.7, 4.4, 9.5, 8.5]
car_sales["Fuel per 100KM"] = fuel_economy

In [ ]:
car_sales

In [ ]:
car_sales["Total fuel"] = (car_sales["Odometer (KM)"] * car_sales["Fuel per 100KM"]) / 100

In [ ]:
car_sales

In [ ]:
# Create a column from a single value
car_sales["Wheels"] = 4
car_sales

In [ ]:
# Delete a column
car_sales["Is ugly"] = False
car_sales

In [ ]:
car_sales.drop("Is ugly", axis=1, inplace=True)

In [ ]:
car_sales

In [ ]:
car_sales["Total fuel"].plot()

In [ ]:
import matplotlib.pyplot as plt

plt.plot(car_sales["Total fuel"])
plt.title("Total Fuel")

plt.xlabel("count")
plt.ylabel("km")
plt.show()

In [ ]:
car_sales["Total fuel"].mean()

In [ ]:
car_sales.drop("Wheels", axis=1, inplace=True)

In [ ]:
car_sales

In [ ]:
car_sales["Passengers"] = 4
car_sales

In [ ]:
import pandas as pd
car_sales = pd.read_csv("7.1 car-sales.csv")

In [ ]:
# Shuffle data
car_sales.sample() # Returns 1 random cell

In [ ]:
car_sales.sample(frac=1) # frac is fractioncar

In [ ]:
car_sales_shuffled = car_sales.sample(frac=1)

In [ ]:
car_sales_shuffled

In [15]:
# Work on 10% of data
car_sales_shuffled.sample(frac=0.1)

     Make Colour  Odometer (KM)  Doors      Price
4  Nissan  White         213095      4  $3,500.00

In [18]:
car_sales_shuffled.reset_index(drop=True, inplace=True)

In [19]:
car_sales_shuffled

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota   Blue          32549      3   $7,000.00
1  Toyota  White          60000      4   $6,250.00
2   Honda    Red          87899      4   $5,000.00
3  Nissan  White         213095      4   $3,500.00
4     BMW  Black          11179      5  $22,000.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          54738      4   $7,000.00
7   Honda   Blue          45698      4   $7,500.00
8  Nissan  White          31600      4   $9,700.00
9  Toyota  White         150043      4   $4,000.00

In [20]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [21]:
car_sales["Odometer (KM)"] = car_sales["Odometer (KM)"].apply(lambda x: x / 1.60)
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White      93776.875      4   $4,000.00
1   Honda    Red      54936.875      4   $5,000.00
2  Toyota   Blue      20343.125      3   $7,000.00
3     BMW  Black       6986.875      5  $22,000.00
4  Nissan  White     133184.375      4   $3,500.00
5  Toyota  Green      62008.125      4   $4,500.00
6   Honda   Blue      28561.250      4   $7,500.00
7   Honda   Blue      34211.250      4   $7,000.00
8  Toyota  White      37500.000      4   $6,250.00
9  Nissan  White      19750.000      4   $9,700.00